azurity.pcd-viewer=0.0.5
charliermarsh.ruff

dracula-theme.theme-dracula=2.25.1
EditorConfig.EditorConfig

eamodio.gitlens
mhutchie.git-graph

KevinRose.vsc-python-indent
k--kato.intellij-idea-keybindings=1.7.4

ms-azuretools.vscode-docker=1.29.4

ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.cmake-tools

ms-python.python
ms-python.debugpy
ms-python.vscode-pylance

ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.vscode-jupyter-slideshow=0.1.6
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-powertoys=0.1.1

ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.remote-server=1.6.2025010809
ms-vscode-remote.remote-ssh
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode-remote.remote-ssh-edit

ms-vscode.vscode-typescript-next=5.9.20250316

shd101wyy.markdown-preview-enhanced

qwtel.sqlite-viewer=25.3.0

VisualStudioExptTeam.vscodeintellicode

vscjava.vscode-java-debug
vscjava.vscode-java-pack
vscjava.vscode-gradle=3.16.2024111106
vscjava.vscode-maven
vscjava.vscode-java-test
vscjava.vscode-java-dependency
Oracle.oracle-java